In [1]:
# Ddd dependencies
import pandas as pd

from sqlalchemy import create_engine
from sqlalchemy.orm import Session
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

from sqlalchemy import Column, Integer, String, Float, Date

In [5]:
# Load csv files
dmgp_data = 'raw_data/demography.csv'
coordinate_data = 'raw_data/statelatlong.csv'
test_data = 'raw_data/test_data.csv'

In [6]:
# Read Data File and store into Pandas Data Frames
dmgp_df = pd.read_csv(dmgp_data)
coordinate_df = pd.read_csv(coordinate_data)
test_df = pd.read_csv(test_data)

In [4]:
dmgp_df.head()

  Geography Gender             age  population
0   Alabama   male   Under_5_years      149374
1   Alabama   male    5_to_9_years      153526
2   Alabama   male  10_to_14_years      157478
3   Alabama   male  15_to_19_years      161735
4   Alabama   male  20_to_24_years      166366

In [5]:
coordinate_df.head()

  State   Latitude   Longitude        City
0    AL  32.601011  -86.680736     Alabama
1    AK  61.302501 -158.775020      Alaska
2    AZ  34.168219 -111.930907     Arizona
3    AR  34.751928  -92.131378    Arkansas
4    CA  37.271875 -119.270415  California

In [7]:
test_df.head()

  category gender    age  year     region  population
0       TV   male  18-24  2013  northeast     5808930
1       TV   male  25-34  2013  northeast     8031355
2       TV   male  35-44  2013  northeast     8555839
3       TV   male  45-54  2013  northeast     7762506
4       TV   male    55+  2013  northeast     4188397

In [8]:
# Create the Schools_data class
class Demography_table(Base):
    __tablename__ = 'demography_table'
    index = Column(Integer, primary_key = True)
    Geography = Column(String(255))
    Gender = Column(String(255))
    age = Column(String(255))
    population = Column(Float)
    
class Coordiate_table(Base):
    __tablename__ = 'coordinate_table'
    index = Column(Integer, primary_key = True)
    State = Column(String(255))
    Latitude = Column(Integer)
    Longitude = Column(Integer)
    City = Column(String(255))
    
class Test1_table(Base):
    __tablename__ = 'test_table'
    index = Column(Integer, primary_key = True)
    category = Column(String(255))
    gender = Column(String(255))
    age = Column(String(255))
    year = Column(Integer)
    region = Column(String(255))
    population = Column(Float)

In [9]:
# Create the datbase and add the classes
engine = create_engine("sqlite:///database.sqlite", echo = False)
conn = engine.connect()
session = Session(engine)

Base.metadata.create_all(conn)

In [10]:
# Send the station dataframe to the sqlite database
dmgp_df.to_sql('demography_table', engine, if_exists='replace')
coordinate_df.to_sql('coordinate_table', engine, if_exists='replace')
test_df.to_sql('test1_table', engine, if_exists='replace')